Documents/CRM_ЗаписьНаТестДрайв.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>CRM_ЗаписьНаТестДрайв</Name>
			<BasedOn>
				<xr:Item>Document.CRM_КоммерческоеПредложение</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.CRM_ЗаписиНаТестДрайв</xr:Item>
				<xr:Item>InformationRegister.CRM_РезультатыКонтактов</xr:Item>
				<xr:Item>InformationRegister.CRM_ПроведенныйТестДрайв</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНапоминания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыдатьНапоминание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроведения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КилометражНаКонец</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КилометражНаНачало</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийРезультата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_МаршрутыТестДрайва</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Начало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_Отделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтказОтАнкетирования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательНапоминания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтмены</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продолжительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийЛист</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_СтатусыТестДрайва</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТестДрайва</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_ТипыТестДрайвов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТопливоНаКонец</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТопливоНаНачало</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БУАвтомобиль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КодыКомментариев</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CRM_ПлановыеРезультатыКонтактов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Результат</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CRM_ОценкаУдовлетворенностиКлиента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оценка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/CRM_КлиентскиеДанные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>CRM_КлиентскиеДанные</Name>
			<Comment>Черновая временная версия архитектуры</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПредложенияИЗамечания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаВыбораМарки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПричиныВыбораМарки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаркаТекущегоАвтомобиля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаркаПредыдущегоАвтомобиля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсточникИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ИсточникиИнформации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьИсточникИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодписантВЛице</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодписантНаОсновании</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодписантПодпись</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодписантДолжность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтказОтКонтакта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СогласиеНаПолучениеSMSДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
			<Comment>Типы контактной информации</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
					<Comment>Телефон</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
					<Comment>Адрес</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Comment>E-Mail</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
					<Comment>Веб-страница</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НомерICQ</Name>
					<Comment>Номер ICQ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
					<Comment>Другая контактная информация (произвольная)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>GoogleАккаунт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДокументов</Name>
			<Comment>Виды подтверждающих документов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сертификат</Name>
					<Comment>Сертификат</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидНаЖительство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Свидетельство</Name>
					<Comment>Свидетельство</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыпискаИзЭлектронногоПаспорта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Лицензия</Name>
					<Comment>Лицензия</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Паспорт</Name>
					<Comment>Общегражданский паспорт</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Удостоверение</Name>
					<Comment>Удостоверение личности</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Приказ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доверенность</Name>
					<Comment>Доверенность</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВоенныйБилет</Name>
					<Comment>Военный билет</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Справка</Name>
					<Comment>Справка (например об освобождении)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СервиснаяКнижка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Прочий документ удостоверяющий личность</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПТС</Name>
					<Comment>Паспорт транспортного средства</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АттестатТО</Name>
					<Comment>Аттестат аккредитации оператора технического осмотра транспортных средств</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/CRM_ЗаписьНаТестДрайв/Forms/ФормаЗаполненияДанныхДляПечати/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// в некоторых местах форма вызывается методом "получитьформу"
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПриОткрытииНаСервере();
  	
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	
	Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		
		Клиент = СсылкаНаОбъект.Клиент;
		//Организация = СсылкаНаОбъект.Организация;
		Дата = СсылкаНаОбъект.ДатаПроведения;
		//ФИО = СсылкаНаОбъект.Клиент.Наименование;
		//Паспорт = CRM_Сервер.ПолучитьДокумент(СсылкаНаОбъект.Клиент, Перечисления.ВидыДокументов.Паспорт);
		//Адрес = Renault_УправлениеКонтактнойИнформацией.АдресКлиента(СсылкаНаОбъект.Клиент);
		ОсновнойТелефон = Renault_УправлениеКонтактнойИнформацией.ПолучитьОсновнойТелефонКлиента(Клиент);
		ОсновнойТелефон = CRM_Сервер.Renault_CRM_СкорректироватьТелефонПриЗаписи(ОсновнойТелефон);
		ПервыйСимволТелефона = ПараметрыСеанса.Renault_ПраваПользователя.ДилерскийЦентр.ПервыйСимволТелефона;
		
		Если НЕ ПустаяСтрока(ПервыйСимволТелефона) Тогда
			ОсновнойТелефон = СтрЗаменить(ОсновнойТелефон, "+", "");
			Если СтрДлина(ОсновнойТелефон) = 11 Тогда
				ОсновнойТелефон = Прав(ОсновнойТелефон, 10);
			КонецЕсли;
		
			МаскаТелефона = Элементы.Телефон.Маска;
			
			ОстатокМаски = Прав(МаскаТелефона, СтрДлина(МаскаТелефона) - 1);
			
			МаскаТелефона = ПервыйСимволТелефона + ОстатокМаски;
			
			Элементы.Телефон.Маска = МаскаТелефона;			
		КонецЕсли;		
		
		Автомобиль = СсылкаНаОбъект.Автомобиль;
		Модель = СсылкаНаОбъект.Автомобиль.Модель;
		ГодВыпуска = СсылкаНаОбъект.Автомобиль.ГодВыпуска;
		VIN = СсылкаНаОбъект.Автомобиль.VIN;
		НомерКузова = СсылкаНаОбъект.Автомобиль.НомерКузова;
		ГосНомер = ПолучитьГосНомер(СсылкаНаОбъект.Автомобиль);
		Цвет = СсылкаНаОбъект.Автомобиль.Цвет;
		Начало = СсылкаНаОбъект.Начало;
		Окончание = СсылкаНаОбъект.Начало + СсылкаНаОбъект.Продолжительность*60;
		//РукОтделаПродаж = CRM_Сервер.ПолучитьРуководителяОтделаПродаж(СсылкаНаОбъект.Организация);
		//ВУ = CRM_Сервер.ПолучитьДокумент(СсылкаНаОбъект.Клиент, Перечисления.ВидыДокументов.Удостоверение);
		//Свидетельство = CRM_Сервер.ПолучитьДокумент(СсылкаНаОбъект.Клиент, Перечисления.ВидыДокументов.Свидетельство);
		
		ПрочитатьДанныеКлиента();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	
	Если Не СохранитьДанные() Тогда Возврат; КонецЕсли;
	
	//Запишем заполненные значения
	Закрыть(Истина);
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьДанныеКлиента()
	
	Запрос = Новый Запрос;                
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ТаблицаКлиентов.НаименованиеПолное,
	               |	ТаблицаКлиентов.Фамилия,
	               |	ТаблицаКлиентов.Имя,
	               |	ТаблицаКлиентов.Отчество,
	               |	ТаблицаКлиентов.ДатаРождения,
	               |	ТаблицаКлиентов.Пол,
	               |	CRM_КлиентскиеДанные.ПредложенияИЗамечания,
	               |	CRM_КлиентскиеДанные.ПричинаВыбораМарки,
	               |	CRM_КлиентскиеДанные.МаркаТекущегоАвтомобиля,
	               |	CRM_КлиентскиеДанные.МаркаПредыдущегоАвтомобиля,
	               |	CRM_КлиентскиеДанные.ДатаСоздания,
	               |	CRM_КлиентскиеДанные.ИсточникИнформации,
	               |	CRM_КлиентскиеДанные.Город,
	               |	КонтактнаяИнформация_Email.Представление КАК ОсновнойEmail,
	               |	ПодтверждающиеДокументы_Паспорт.Серия КАК ПаспортСерия,
	               |	ПодтверждающиеДокументы_Паспорт.Номер КАК ПаспортНомер,
	               |	ПодтверждающиеДокументы_Паспорт.ДатаВыдачи КАК ПаспортДатаВыдачи,
	               |	ПодтверждающиеДокументы_Паспорт.КемВыдан КАК ПаспортКемВыдан,
	               |	ПодтверждающиеДокументы_ВУ.Серия КАК ВУСерия,
	               |	ПодтверждающиеДокументы_ВУ.Номер КАК ВУНомер,
	               |	ПодтверждающиеДокументы_ВУ.ДатаВыдачи КАК ВУДатаВыдачи,
	               |	ПодтверждающиеДокументы_ВУ.КемВыдан КАК ВУКемВыдано,
	               |	КонтактнаяИнформация_АдресФактический.Представление КАК АдресФактический,
	               |	КонтактнаяИнформация_АдресЮридический_Прописки.Представление КАК АдресЮридический,
	               |	ВЫБОР
	               |		КОГДА КонтактнаяИнформация_АдресЮридический_Прописки.Представление = """"
	               |				ИЛИ КонтактнаяИнформация_АдресЮридический_Прописки.Представление ЕСТЬ NULL
	               |			ТОГДА КонтактнаяИнформация_АдресФактический.Представление
	               |		ИНАЧЕ КонтактнаяИнформация_АдресЮридический_Прописки.Представление
	               |	КОНЕЦ КАК АдресПрописки,
	               |	ТаблицаКлиентов.ФормаСобственности,
	               |	ТаблицаКлиентов.ИНН,
	               |	ТаблицаКлиентов.КПП,
	               |	CRM_КлиентскиеДанные.ПодписантВЛице,
	               |	CRM_КлиентскиеДанные.ПодписантНаОсновании,
	               |	CRM_КлиентскиеДанные.ПодписантПодпись,
	               |	CRM_КлиентскиеДанные.ПодписантДолжность,
	               |	ТаблицаКлиентов.ОсновнойБанковскийСчет,
	               |	ТаблицаКлиентов.Наименование
	               |ИЗ
	               |	Справочник.CRM_ПотенциальныеКонтрагенты КАК ТаблицаКлиентов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_КлиентскиеДанные КАК CRM_КлиентскиеДанные
	               |		ПО (CRM_КлиентскиеДанные.Клиент = ТаблицаКлиентов.Ссылка)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация_ТелефонСотовый
	               |		ПО ТаблицаКлиентов.Ссылка = КонтактнаяИнформация_ТелефонСотовый.Объект
	               |			И (КонтактнаяИнформация_ТелефонСотовый.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
	               |			И (КонтактнаяИнформация_ТелефонСотовый.ЗначениеПоУмолчанию = ИСТИНА)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация_Email
	               |		ПО ТаблицаКлиентов.Ссылка = КонтактнаяИнформация_Email.Объект
	               |			И (КонтактнаяИнформация_Email.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))
	               |			И (КонтактнаяИнформация_Email.ЗначениеПоУмолчанию = ИСТИНА)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы_Паспорт
	               |		ПО ТаблицаКлиентов.Ссылка = ПодтверждающиеДокументы_Паспорт.Владелец
	               |			И (ПодтверждающиеДокументы_Паспорт.ВидПодтверждающегоДокумента = ЗНАЧЕНИЕ(Перечисление.ВидыДокументов.Паспорт))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы_ВУ
	               |		ПО ТаблицаКлиентов.Ссылка = ПодтверждающиеДокументы_ВУ.Владелец
	               |			И (ПодтверждающиеДокументы_ВУ.ВидПодтверждающегоДокумента = ЗНАЧЕНИЕ(Перечисление.ВидыДокументов.Удостоверение))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация_АдресЮридический_Прописки
	               |		ПО ТаблицаКлиентов.Ссылка = КонтактнаяИнформация_АдресЮридический_Прописки.Объект
	               |			И (КонтактнаяИнформация_АдресЮридический_Прописки.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресЮридический))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация_АдресФактический
	               |		ПО ТаблицаКлиентов.Ссылка = КонтактнаяИнформация_АдресФактический.Объект
	               |			И (КонтактнаяИнформация_АдресФактический.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресФактический))
	               |ГДЕ
	               |	ТаблицаКлиентов.Ссылка = &Ссылка";
				   
	Если ТипЗнч(Клиент) = Тип("СправочникСсылка.Контрагенты") Тогда			   
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "CRM_ПотенциальныеКонтрагенты", "Контрагенты");
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;	
	Запрос.УстановитьПараметр("Ссылка", Клиент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма, Выборка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СохранитьДанные()
	
	Если ОшибкиЗаполнения() Тогда Возврат Ложь; КонецЕсли;	
	
	//Потенциальный клиент / Контрагент
	КлиентОбъект = Клиент.ПолучитьОбъект();
	//ЗаполнитьЗначенияСвойств(КлиентОбъект, ЭтаФорма);
	КлиентОбъект.Наименование = Наименование;
	КлиентОбъект.НаименованиеПолное = Наименование;
	КлиентОбъект.Записать();
	
	//Клиентские данные
	//Запись = РегистрыСведений.CRM_КлиентскиеДанные.СоздатьМенеджерЗаписи();	
	//ЗаполнитьЗначенияСвойств(Запись, ЭтаФорма);
	//Запись.Записать();
	
	//Документы
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Клиент);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПодтверждающиеДокументы.Ссылка
	|ИЗ
	|	Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
	|ГДЕ
	|	ПодтверждающиеДокументы.Владелец = &Ссылка
	|	И ПодтверждающиеДокументы.ВидПодтверждающегоДокумента = &Вид";
	
	Запрос.УстановитьПараметр("Вид", Перечисления.ВидыДокументов.Паспорт);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Об = Выборка.Ссылка.ПолучитьОбъект();
	Иначе
		Об = Справочники.ПодтверждающиеДокументы.СоздатьЭлемент();
	КонецЕсли;
	Если ЗначениеЗаполнено(ПаспортСерия) 
			ИЛИ ЗначениеЗаполнено(ПаспортНомер) 
			ИЛИ ЗначениеЗаполнено(ПаспортДатаВыдачи) 
			ИЛИ ЗначениеЗаполнено(ПаспортКемВыдан) Тогда
		Об.Наименование = "Паспорт";
		Об.Владелец = Клиент;
		Об.Серия = ПаспортСерия;
		Об.Номер = ПаспортНомер;
		Об.ДатаВыдачи = ПаспортДатаВыдачи;
		Об.КемВыдан = ПаспортКемВыдан;
		Об.ВидПодтверждающегоДокумента = Перечисления.ВидыДокументов.Паспорт;
		Попытка
			Об.Записать();
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;

	ИначеЕсли НЕ Об.ЭтоНовый() Тогда
		Об.Удалить();
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Вид", Перечисления.ВидыДокументов.Удостоверение);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Об = Выборка.Ссылка.ПолучитьОбъект();
	Иначе
		Об = Справочники.ПодтверждающиеДокументы.СоздатьЭлемент();
	КонецЕсли;
	Если ЗначениеЗаполнено(ВУСерия) 
			ИЛИ ЗначениеЗаполнено(ВУНомер) 
			ИЛИ ЗначениеЗаполнено(ВУДатаВыдачи) 
			ИЛИ ЗначениеЗаполнено(ВУКемВыдано) Тогда
		Об.Наименование = "Водительское удостоверение";
		Об.Владелец = Клиент;
		Об.Серия = ВУСерия;
		Об.Номер = ВУНомер;
		Об.ДатаВыдачи = ВУДатаВыдачи;
		Об.КемВыдан = ВУКемВыдано;
		Об.ВидПодтверждающегоДокумента = Перечисления.ВидыДокументов.Удостоверение;
		Попытка
			Об.Записать();
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
	ИначеЕсли НЕ Об.ЭтоНовый() Тогда
		Об.Удалить();
	КонецЕсли;
	
	//Контактные данные
	
	Renault_УправлениеКонтактнойИнформацией.ЗаписатьОсновнойТелефонКлиента(ОсновнойТелефон, Клиент);
	
	//Менеджер = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
	//Менеджер.Объект = Объект.Ссылка;
	//Менеджер.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
	//Менеджер.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонДомашний;
	//Если ЗначениеЗаполнено(ДомашнийТелефон) Тогда
	//	Менеджер.Представление = ДомашнийТелефон;
	//	Менеджер.Записать(Истина);
	//Иначе
	//	Менеджер.Удалить();
	//КонецЕсли;
	
	//Менеджер = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
	//Менеджер.Объект = Клиент;
	//Менеджер.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
	//Менеджер.Вид = Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыДомашний;
	//Если ЗначениеЗаполнено(ОсновнойEmail) Тогда
	//	Менеджер.Представление = ОсновнойEmail;
	//	Менеджер.Записать(Истина);
	//Иначе
	//	Менеджер.Удалить();
	//КонецЕсли;
	
	//Менеджер = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
	//Менеджер.Объект = Клиент;
	//Менеджер.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
	//Менеджер.Вид = Справочники.ВидыКонтактнойИнформации.АдресФактический;
	//Если ЗначениеЗаполнено(АдресФактический) ИЛИ ЗначениеЗаполнено(Город) Тогда
	//	Менеджер.Представление = ?(ЗначениеЗаполнено(АдресФактический), АдресФактический, Город);
	//	Менеджер.Поле4 = Город;
	//	Менеджер.Записать(Истина);
	//Иначе
	//	Менеджер.Удалить();
	//КонецЕсли;
	
	Менеджер = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
	Менеджер.Объект = Клиент;
	Менеджер.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
	Менеджер.Вид = Справочники.ВидыКонтактнойИнформации.АдресЮридический;
	Если ЗначениеЗаполнено(АдресПрописки) Тогда
		Менеджер.Представление = АдресПрописки;
		Менеджер.Записать(Истина);
	ИначеЕсли ЗначениеЗаполнено(АдресЮридический) Тогда
		Менеджер.Представление = АдресЮридический;
		Менеджер.Записать(Истина);
	Иначе
		Менеджер.Удалить();
	КонецЕсли;
	
	//Справочники.Автомобили.ЗаписьЗначенияРегистраСведения(Автомобиль,ГосНомер,Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер);
	
	Модифицированность = Ложь;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ОшибкиЗаполнения()

	Отказ = Ложь;
	
	Отказ = ?(Отказ,Истина, Не ЗначениеЗаполнено(Наименование));
	Если Не ЗначениеЗаполнено(Наименование) Тогда Сообщить("Не заполнено поле ""ФИО"""); КонецЕсли;
	
	ВУзаполнено = ЗначениеЗаполнено(ВУСерия) И ЗначениеЗаполнено(ВУНомер) 
				  И ЗначениеЗаполнено(ВУКемВыдано) И ЗначениеЗаполнено(ВУДатаВыдачи);
				  
	Если Не ВУзаполнено Тогда Сообщить("Не заполнены данные водительского удостоверения"); КонецЕсли;			  
				  
	Отказ = ?(Отказ,Истина, Не ВУзаполнено);
	
	Возврат Отказ;

КонецФункции // ПроверитьЗаполненение()

&НаСервере
Процедура ПрочитатьДанные()
	
	Клиент = СсылкаНаОбъект.Клиент;
	//Организация = СсылкаНаОбъект.Организация;
	Дата = СсылкаНаОбъект.ДатаПроведения;
	//ФИО = СсылкаНаОбъект.Клиент.Наименование;
	//Паспорт = CRM_Сервер.ПолучитьДокумент(СсылкаНаОбъект.Клиент, Перечисления.ВидыДокументов.Паспорт);
	//Адрес = Renault_УправлениеКонтактнойИнформацией.АдресКлиента(СсылкаНаОбъект.Клиент);
	//Телефон = Renault_УправлениеКонтактнойИнформацией.ТелефонКлиента(СсылкаНаОбъект.Клиент);
	Автомобиль = СсылкаНаОбъект.Автомобиль;
	Модель = СсылкаНаОбъект.Автомобиль.Модель;
	ГодВыпуска = СсылкаНаОбъект.Автомобиль.ГодВыпуска;
	VIN = СсылкаНаОбъект.Автомобиль.VIN;
	НомерКузова = СсылкаНаОбъект.Автомобиль.НомерКузова;
	ГосНомер = ПолучитьГосНомер(СсылкаНаОбъект.Автомобиль);
	Цвет = СсылкаНаОбъект.Автомобиль.Цвет;
	Начало = СсылкаНаОбъект.Начало;
	Окончание = СсылкаНаОбъект.Начало + СсылкаНаОбъект.Продолжительность*60;
	//РукОтделаПродаж = CRM_Сервер.ПолучитьРуководителяОтделаПродаж(СсылкаНаОбъект.Организация);
	//ВУ = CRM_Сервер.ПолучитьДокумент(СсылкаНаОбъект.Клиент, Перечисления.ВидыДокументов.Удостоверение);
	//Свидетельство = CRM_Сервер.ПолучитьДокумент(СсылкаНаОбъект.Клиент, Перечисления.ВидыДокументов.Свидетельство);
	
	ПрочитатьДанныеКлиента();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьГосНомер(Автомобиль,НаДату = Неопределено)
	Возврат Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер,НаДату);
КонецФункции
